#Использовать 1commands
#Использовать tempfiles

Перем Лог;
Перем КаталогИсходниковEDT;
Перем КаталогРезультатаКонвертации;
Перем РабочийКаталогРИНГ;
Перем КаталогЕДТ Экспорт;
Перем КаталогРабочейОбластиЕДТ Экспорт;


Процедура УстановитьЛог(НовыйЛог) Экспорт
	Лог=НовыйЛог;
КонецПроцедуры

Процедура УстановитьКаталогИсходниковEDT(НовыйКаталогЕДТ) Экспорт
	КаталогИсходниковEDT=НовыйКаталогЕДТ;
КонецПроцедуры

Процедура УстановитьКаталогРезультатаКонвертации(НовыйКаталогРезультатаКонвертации) Экспорт
	КаталогРезультатаКонвертации=НовыйКаталогРезультатаКонвертации;
КонецПроцедуры

Функция ВыполнитьКонвертацию() Экспорт
	Если Не ЗначениеЗаполнено(КаталогЕДТ) Тогда
		Сообщить("Не указан каталог расположения исполняемых файлов 1cedtcli. Конвертация исходников невозможна");
		Возврат Ложь;
	КонецЕсли;
	МенеджерВременныхФайлов = Новый МенеджерВременныхФайлов();
	// МенеджерВременныхФайлов.БазовыйКаталог = ОбъединитьПути(КаталогРезультатаКонвертации, "EDTWorkspace");
	
	Если ЗначениеЗаполнено(КаталогРабочейОбластиЕДТ) Тогда
		РабочийКаталогРИНГ = КаталогРабочейОбластиЕДТ;
	Иначе
		РабочийКаталогРИНГ = МенеджерВременныхФайлов.СоздатьКаталог();
	КонецЕсли;
	
	ЭтоWindows = ОбщиеМетоды.ЭтоWindows();
	Если ЭтоWindows Тогда
		ПутьКФайлуCLI = ОбъединитьПути(КаталогЕДТ, "1cedtcli.exe");
	Иначе
		ВариантыСкриптаЗапускаEDT = Новый Массив;
		ВариантыСкриптаЗапускаEDT.Добавить("1cedtcli");
		ВариантыСкриптаЗапускаEDT.Добавить("1cedtcli.sh");
		
		ПутьКФайлуCLI = "";
		Для Каждого ТекВариантСкрипта Из ВариантыСкриптаЗапускаEDT Цикл
			ПутьДляПроверки = ОбъединитьПути(КаталогЕДТ, ТекВариантСкрипта);
			
			ФайлПутиКПроверке = Новый Файл(ПутьДляПроверки);
			Если ФайлПутиКПроверке.Существует() Тогда
				ПутьКФайлуCLI = ПутьДляПроверки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ФайлCLI = Новый Файл(ПутьКФайлуCLI);
	Если Не ФайлCLI.Существует() Тогда
		Сообщить("Не обнаружен файл едт "+ПутьКФайлуCLI);
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаЗапуска = """"+ПутьКФайлуCLI+""" -v -data """+РабочийКаталогРИНГ+""" -command export --project """+КаталогИсходниковEDT+""" --configuration-files """+КаталогРезультатаКонвертации+"""";


	КомандныйФайл = Новый КомандныйФайл;
	КомандныйФайл.Создать();
	//КомандныйФайл.ДобавитьКоманду("chcp 65001");
	КомандныйФайл.ДобавитьКоманду(СтрокаЗапуска);


//	КомандныйФайл.УстановитьКодировкуВывода(КодировкаТекста.UTF8);
	КомандныйФайл.ПоказыватьВыводНемедленно(Истина);

	КодВозврата = КомандныйФайл.Исполнить();
	МенеджерВременныхФайлов.Удалить();
	
	Возврат КодВозврата=0;
КонецФункции

КаталогРабочейОбластиЕДТ = "";
Лог=Новый Лог("app.build.tools_ui_1c");